<a href="https://colab.research.google.com/github/Nkbhapkar/book_recomendation_system/blob/main/capston_book_recommendation_system.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd 
import matplotlib as pyplot 
import seaborn as sns 
import warnings 

warnings.filterwarnings("ignore")

In [3]:
books_df = pd.read_csv('/content/drive/MyDrive/Copy of Books.csv')
user_df = pd.read_csv('/content/drive/MyDrive/Copy of Users.csv')
ratings_df =pd.read_csv('/content/drive/MyDrive/Copy of Ratings.csv')

In [4]:
print ( "Books shape :" ,books_df.shape)
print ("user shape: " ,user_df.shape)
print("rating shape:" , ratings_df.shape)

Books shape : (271360, 8)
user shape:  (278858, 3)
rating shape: (1149780, 3)

In [5]:
books_df.head()

         ISBN  ...                                        Image-URL-L
0  0195153448  ...  http://images.amazon.com/images/P/0195153448.0...
1  0002005018  ...  http://images.amazon.com/images/P/0002005018.0...
2  0060973129  ...  http://images.amazon.com/images/P/0060973129.0...
3  0374157065  ...  http://images.amazon.com/images/P/0374157065.0...
4  0393045218  ...  http://images.amazon.com/images/P/0393045218.0...

[5 rows x 8 columns]

In [6]:
#Drop unwanted column from dataset 
books_df.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [7]:
books_df.drop(['Image-URL-S', 'Image-URL-M', 'Image-URL-L'], axis=1 ,inplace= True)

In [8]:
books_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271359 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB

In [9]:
books_df.isnull().sum()

ISBN                   0
Book-Title             0
Book-Author            1
Year-Of-Publication    0
Publisher              2
dtype: int64

In [10]:
books_df.loc[books_df["Book-Author"].isnull(),:]

              ISBN  ...                       Publisher
187689  9627982032  ...  Edinburgh Financial Publishing

[1 rows x 5 columns]

In [11]:
books_df.loc[books_df['Publisher'].isnull(),:]

              ISBN       Book-Title  ... Year-Of-Publication Publisher
128890  193169656X      Tyrant Moon  ...                2002       NaN
129037  1931696993  Finders Keepers  ...                2001       NaN

[2 rows x 5 columns]

In [12]:
books_df.at[187689 , "Book-Author"] = "Other"
books_df.at[128890 , "Publisher"] = "Other"
books_df.at[129037 , "Publisher"] = "Other"

In [13]:
books_df['Year-Of-Publication'].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', 'DK Publishing Inc', '1943', '1938',
       '1900', '1942', '1923', '1920', '1933', 'Gallimard', '1909',
       '1946', '2008', '1378', '2030', '1936', '1947', '2011', '2020',
       '1919', '1949', '1922', '1897', '2024', '1376', '1926', '2037'],
      dtype=object)

In [14]:

pd.set_option('display.max_colwidth', -1)

In [15]:
books_df.loc[books_df['Year-Of-Publication']=='DK Publishing Inc',:]

              ISBN  ...                                                     Publisher
209538  078946697X  ...  http://images.amazon.com/images/P/078946697X.01.THUMBZZZ.jpg
221678  0789466953  ...  http://images.amazon.com/images/P/0789466953.01.THUMBZZZ.jpg

[2 rows x 5 columns]

In [16]:
books_df.loc[books_df['Year-Of-Publication']=='Gallimard',:]

              ISBN  ...                                                     Publisher
220731  2070426769  ...  http://images.amazon.com/images/P/2070426769.01.THUMBZZZ.jpg

[1 rows x 5 columns]

In [17]:
#changing the data into proper format 
books_df.at[209538 , 'Book-Title'] = 'DK Readers: Creating the X-Men, How It All Began (Level 4: Proficient Readers)'
books_df.at[209538 , 'Book-Author'] = 'Michael Teitelbaum'
books_df.at[209538 , 'Year-Of-Publication'] = 2000
books_df.at[209538 , 'Publisher'] = 'DK Publishing Inc'

books_df.at[221678, 'Book-Title'] = 'DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)'
books_df.at[221678, 'Book-Author'] = 'James Buckley'
books_df.at[221678 , 'Year-Of-Publication'] = 2000
books_df.at[221678, 'Publisher'] = 'DK Publishing Inc'


books_df.at[220731, 'Book-Title'] = 'Peuple du ciel, suivi de Les Bergers'
books_df.at[220731, 'Book-Author'] = 'Jean-Marie Gustave Le ClÃ?Â©zio'
books_df.at[220731 , 'Year-Of-Publication'] = 2003
books_df.at[220731, 'Publisher'] = 'Gallimard'

In [18]:
books_df['Year-Of-Publication'] = books_df['Year-Of-Publication'].astype(int)

In [19]:
print(sorted(list(books_df['Year-Of-Publication'].unique())))

[0, 1376, 1378, 1806, 1897, 1900, 1901, 1902, 1904, 1906, 1908, 1909, 1910, 1911, 1914, 1917, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2008, 2010, 2011, 2012, 2020, 2021, 2024, 2026, 2030, 2037, 2038, 2050]

In [20]:
books_df.loc[books_df['Year-Of-Publication'] > 2021, 'Year-Of-Publication'] = 2002
books_df.loc[books_df['Year-Of-Publication'] == 0, 'Year-Of-Publication'] = 2002

In [21]:
books_df['ISBN'] = books_df['ISBN'].str.upper()

In [22]:
## Drop duplicate rows
books_df.drop_duplicates(keep='last', inplace=True) 
books_df.reset_index(drop = True, inplace = True)

In [23]:
books_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271047 entries, 0 to 271046
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271047 non-null  object
 1   Book-Title           271047 non-null  object
 2   Book-Author          271047 non-null  object
 3   Year-Of-Publication  271047 non-null  int64
 4   Publisher            271047 non-null  object
dtypes: int64(1), object(4)
memory usage: 10.3+ MB

In [24]:
books_df.head()

         ISBN  ...                   Publisher
0  0195153448  ...  Oxford University Press
1  0002005018  ...  HarperFlamingo Canada
2  0060973129  ...  HarperPerennial
3  0374157065  ...  Farrar Straus Giroux
4  0393045218  ...  W. W. Norton &amp; Company

[5 rows x 5 columns]

# *User dataset *

In [25]:
user_df.columns

Index(['User-ID', 'Location', 'Age'], dtype='object')

In [26]:
user_df.head()

   User-ID                            Location   Age
0  1        nyc, new york, usa                 NaN
1  2        stockton, california, usa           18.0
2  3        moscow, yukon territory, russia    NaN
3  4        porto, v.n.gaia, portugal           17.0
4  5        farnborough, hants, united kingdom NaN

In [27]:
user_df.isnull().sum()

User-ID     0
Location    0
Age         110762
dtype: int64

In [28]:
(user_df['Age'].unique())

array([ nan,  18.,  17.,  61.,  26.,  14.,  25.,  19.,  46.,  55.,  32.,
        24.,  20.,  34.,  23.,  51.,  31.,  21.,  44.,  30.,  57.,  43.,
        37.,  41.,  54.,  42.,  50.,  39.,  53.,  47.,  36.,  28.,  35.,
        13.,  58.,  49.,  38.,  45.,  62.,  63.,  27.,  33.,  29.,  66.,
        40.,  15.,  60.,   0.,  79.,  22.,  16.,  65.,  59.,  48.,  72.,
        56.,  67.,   1.,  80.,  52.,  69.,  71.,  73.,  78.,   9.,  64.,
       103., 104.,  12.,  74.,  75., 231.,   3.,  76.,  83.,  68., 119.,
        11.,  77.,   2.,  70.,  93.,   8.,   7.,   4.,  81., 114., 230.,
       239.,  10.,   5., 148., 151.,   6., 101., 201.,  96.,  84.,  82.,
        90., 123., 244., 133.,  91., 128.,  94.,  85., 141., 110.,  97.,
       219.,  86., 124.,  92., 175., 172., 209., 212., 237.,  87., 162.,
       100., 156., 136.,  95.,  89., 106.,  99., 108., 210.,  88., 199.,
       147., 168., 132., 159., 186., 152., 102., 116., 200., 115., 226.,
       137., 207., 229., 138., 109., 105., 228., 183., 204.,  98., 223.,
       113., 208., 107., 157., 111., 146., 118., 220., 143., 140., 189.,
       127.])

In [29]:
required = user_df[user_df['Age'] <= 80]
required = required[required['Age'] >= 10]

In [30]:
mean = round(required['Age'].mean())
mean

35

In [31]:
user_df.loc[user_df['Age']>80 , 'Age'] = mean      #outliers with age grater than 80 are substituted with mean 
user_df.loc[user_df['Age']<10 , 'Age'] = mean      #outliers with age less than 10 years are substitued with mean
user_df['Age'] = user_df['Age'].fillna(mean)       #filling null values with mean
user_df['Age'] = user_df['Age'].astype(int)        #changing Datatype to int

In [32]:
list = user_df.Location.str.split(', ')
city = []
state = []
country = []
count_no_state = 0    
count_no_country = 0
for i in range(0,len(list)):
  if list[i][0] == ' ' or list[i][0] == '' or list[i][0] == 'n/a' or list[i][0] == ',' :
    city.append('other')
  else :
        city.append(list[i][0].lower())

  if (len(list[i])<2):
        state.append('other')
        country.append('other')
        count_no_state += 1
        count_no_country += 1
  else:
        if list[i][1] == ' ' or list[i][1] == '' or list[i][1]=='n/a' or list[i][1] == ',':   #removing invalid entries 
            state.append('other')
            count_no_state += 1            
        else:
            state.append(list[i][1].lower())
        
        if(len(list[i])<3):
            country.append('other')
            count_no_country += 1
        else:
            if list[i][2] == ''or list[i][1] == ',' or list[i][2] == ' ' or list[i][2] == 'n/a':
                country.append('other')
                count_no_country += 1
            else:
                country.append(list[i][2].lower())


user_df = user_df.drop('Location', axis=1)
temp = []
for ent in city:
    c = ent.split('/')            #handling cases where city/state entries from city list as state is already given 
    temp.append(c[0])

df_city = pd.DataFrame(temp,columns=['City'])
df_state = pd.DataFrame(state,columns=['State'])
df_country = pd.DataFrame(country,columns=['Country'])

user_df = pd.concat([user_df , df_city], axis=1)
user_df = pd.concat([user_df , df_state], axis=1)
user_df = pd.concat([user_df , df_country], axis=1)

print(count_no_country)   #printing the number of countries didnt have any values 
print(count_no_state)     #printing the states which didnt have any values

4659
16044

In [33]:
## Drop duplicate rows
user_df.drop_duplicates(keep='last', inplace=True)
user_df.reset_index(drop=True, inplace=True)

In [34]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  278858 non-null  int64
 1   Age      278858 non-null  int64
 2   City     278858 non-null  object
 3   State    278858 non-null  object
 4   Country  278858 non-null  object
dtypes: int64(2), object(3)
memory usage: 10.6+ MB

In [35]:
user_df.head()

   User-ID  Age         City            State         Country
0  1        35   nyc          new york         usa
1  2        18   stockton     california       usa
2  3        35   moscow       yukon territory  russia
3  4        17   porto        v.n.gaia         portugal
4  5        35   farnborough  hants            united kingdom

# **Book rating dataset pre-processing**